Results/axum-bench/SingleThreaded/Large/25/2.txt
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.34.144 (be patient)
Completed 2000 requests
Completed 4000 requests
Completed 6000 requests
Completed 8000 requests
Completed 10000 requests
Completed 12000 requests
Completed 14000 requests
Completed 16000 requests
Completed 18000 requests
Completed 20000 requests
Finished 20000 requests


Server Software:        
Server Hostname:        172.31.34.144
Server Port:            8080

Document Path:          /prototype_kilogram_large.jpg
Document Length:        4194304 bytes

Concurrency Level:      25
Time taken for tests:   74.082 seconds
Complete requests:      20000
Failed requests:        0
Keep-Alive requests:    20000
Total transferred:      83890060000 bytes
HTML transferred:       83886080000 bytes
Requests per second:    269.97 [#/sec] (mean)
Time per request:       92.602 [ms] (mean)
Time per request:       3.704 [ms] (mean, across all concurrent requests)
Transfer rate:          1105858.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    53   93   7.5     93     124
Waiting:        0    3   0.5      3       4
Total:         53   93   7.5     93     124

Percentage of the requests served within a certain time (ms)
  50%     93
  66%     96
  75%     98
  80%     99
  90%    102
  95%    105
  98%    108
  99%    111
 100%    124 (longest request)